# 位运算
print(0.1 + 0.2) # bug 0.30000000000000004 位运算从十进制转为二进制，都有这个bug   tmd js 也是
print(10/3) #          3.3333333333333335
print(0.1 + 0.1 + 0.1 - 0.2) # 0.10000000000000003
# >> 不要使用浮点数的位运算

"""
算术运算符
+
-
*
/
%  求模
// 整除
** 求幂运算
"""
print(321 % 123) # 75
print(11 % 5) # 1 余数

print(11 // 5) # 2
print(22 // 5) # 4

print(10 ** 3) # 1000
print(5 ** 3) # 125


# 除
print(4/3) # 会有小数

"""
赋值运算符 and 复合赋值运算
"""
a = 45
a -= 1
print(a) # 44
a /= 2
print(a) # 22.0  why?

b = 6
b += 1
print(b) # 7
b *= 2
print(b) # 14


"""
比较运算符
== 相等
and 与 即js &&
or 或 即js ||
not 非 即js !
> 大于
< 小于
"""
# print(1 === 1) 没有这种写法 只有 = 赋值 和 == 相等ｓ


"""
示例一 使用比较运算符 转换华氏摄氏度和摄氏摄氏度
输出时使用 print 函数, `%` 是变量占位符 
`%.1f` `float` 浮点数类型 .1表示保留一位小数
`%d` `int` 整型替换
`%s` `str` 字符串替换
"""

f = float(input('请输入华氏温度：'))
c = (f - 32) / 1.8
print('%.1f华氏度 = %.1f摄氏度' % (f,c)) # 100.0华氏度 = 37.8摄氏度


"""
示例二 计算圆形周长和面积
"""
r = float(input('输入圆形半径：'))
girth = 2 * r * 3.14156 #暂用 3.14156 表示数学pai 的值
area = 3.14156 * r ** 2
print('圆的周长为：%.5f and 圆的面积为 %.5f' % (girth,area))


"""
示例三 计算闰年
"""
year = int(input('请输入年份：'))
run = year % 4 == 0  # 无法强行转换为 布尔值 ，可以用 and 或者 or 转换
print('%d' % (run))

print(1 and 0) # 1

is_leap = year % 4 == 0 and year % 100 != 0 or year % 400 == 0
print(is_leap)